---
kind: property
id: P:Autodesk.Revit.DB.Electrical.DistributionSysType.VoltageLineToLine
source: html/3b0d256f-2611-57f5-05b7-065d60259e7a.htm
---
# Autodesk.Revit.DB.Electrical.DistributionSysType.VoltageLineToLine Property

Get or set line to line voltage type of distribution system type.

## Syntax (C#)
```csharp
public VoltageType VoltageLineToLine { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The voltage retrieved here is read only and actions to modify its properties it will throw an System.InvalidOperationException.